# עליך לחשב ממוצע טמפרטורה של 5 ערים בעולם
# רוץ בלולאה מ- 1 עד 5 ובכל פעם קלוט את הטמפרטורה
# אם הטמפרטורה קטנה ממינוס 50 או גדולה מפלוס 45 קלוט שוב ושוב, עד אשר הטמפרטורה
# תהיה בטווח.
# בתום הקלט של 5 הערים , חשב את ממוצע הטמפרטורה. רמז: ראה קוד של השיעור

city = 0
sum_temp: float = 0.0         # חישוב כולל של הטמפרטורה בכל הערים
for city in range(5):         # לולאת הfor, תרוץ על חמשת הערים
    while True:               # לולאת הwhile רצה על כל עיר (-על כל איטרציה של for ), ובודקת האם התנאי בה מתקיים
        temp: float = float(input("temp in your city: "))  # הוכנסה טמפרטורה באיטרציה מסויימת
        if -50 <= temp <= 45: # ומתבצעת בדיקה אם התנאי (הטמפ בתטווח שהוגדר) מתקיים
            break             # אם התנאי מתקיים נשתמש בbreak - ערך הטמפ יקפוץ מהתנאי
        else:                                       # אחרת- אם התנאי לא מתקיים
            print("temp is invalid, try again ")    #  מתבצעת הדפסה המבקשת לנסות שןב
    print(f"{temp}, city {city+1}")    # הערך יודפס-זו הטמפרטורה בעיר מסויימת\באיטרצית FOR מסויימת מספר האיטרציה מודפס גם
    sum_temp += temp                 # נחבר את ערך הטמפרטורה לסכום הכולל

avg: float=  sum_temp / 5     # אחרי כל איטרציןת ה for נחשב את הממןצע
print(f"this is avg: {avg}")  # ונדפיס









# else:
# print("this temp is nto range, try again  ")