# קלוט מספרים מהמשתמש , כל עוד המספר שנקלט מתחלק ב - 7 ללא שארית
# ברגע שייקלט מספר שאיננו מתחלק ב - 7 ללא שארית לדוגמא 10, צא מהלולאה ואז
# הדפס כמה מספרים המתחלקים ב- 7 ללא שארית נקלטו.
# אם המשתמש הכניס מספר המתחלק ב- 11 ללא שארית לדוגמא 33 , צא ב- break
# מהלולאה, ואל תדפיס כמה מספרים נקלטו . רמז - else while
# לדוגמא עבור : ,14 ,21 ,28 ,35 ,105 12 יודפס 5
# לדוגמא עבור : ,63 ,7 ,42 77 לא יודפס כלום מכיוון ש- 77 מתחלק ב- 11 ללא שארית

counter_div_7 = 0
num: int = 0

while num %7 == 0:
    num: int = int(input("enter your number:"))
    if num %7 == 0:
        counter_div_7 += 1
        if num %11 == 0:
            break
else:
    print(f"{counter_div_7} numbers divide by 7")

print("bay")